<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>PayloadDisplayName</key>
    <string>Login Window Settings</string>
    <key>PayloadDescription</key>
    <string>Configures settings related to the login window</string>
    <key>PayloadOrganization</key>
    <string><%= @profile_payload_org %></string>
    <key>PayloadRemovalDisallowed</key>
    <<%= @payload_removal_disallowed %>/>
    <key>PayloadScope</key>
    <string>System</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadIdentifier</key>
    <string><%= @profile_identifier_prefix %></string>
    <key>PayloadUUID</key>
    <string>CF411CE1-B799-4CEC-9609-DB85976080C7</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadEnabled</key>
    <true/>
    <key>PayloadContent</key>
    <array>
      <dict>
        <key>PayloadDisplayName</key>
        <string>Login Window: Global Preferences</string>
        <key>AutoLogOutDelay</key>
        <integer><%= @auto_logout_delay %></integer>
        <key>MultipleSessionEnabled</key>
        <<%= @fast_user_switching_enabled %>/>
        <key>PayloadEnabled</key>
        <true/>
        <key>PayloadIdentifier</key>
        <string><%= @profile_identifier_prefix %>.loginwindow.84364940-3884-0137-bb47-784f43519bbc.GlobalPreferences</string>
        <key>PayloadType</key>
        <string>.GlobalPreferences</string>
        <key>PayloadUUID</key>
        <string>A69C66DE-5DEB-4D04-9754-10DFDF353D47</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
      </dict>
      <dict>
        <key>PayloadDisplayName</key>
        <string>Login Window: MCX Preferences</string>
        <key>DisableGuestAccount</key>
        <<%= @guest_disbled %>/>
        <key>EnableGuestAccount</key>
        <<%= @guest_enabled %>/>
        <key>PayloadEnabled</key>
        <true/>
        <key>PayloadIdentifier</key>
        <string><%= @profile_identifier_prefix %>.loginwindow.84364940-3884-0137-bb47-784f43519bbc.MCX</string>
        <key>PayloadType</key>
        <string>com.apple.MCX</string>
        <key>PayloadUUID</key>
        <string>ADAE4FDC-2137-4725-BEDF-8968B4483D47</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
      </dict>
      <dict>
        <key>PayloadDisplayName</key>
        <string>Login Window</string>
        <key>AdminMayDisableMCX</key>
        <<%= @admin_may_disable_MCX %>/>
        <key>AllowList</key>
        <array/>
        <key>AlwaysShowWorkgroupDialog</key>
        <false/>
        <key>CombineUserWorkgroups</key>
        <true/>
        <key>DenyList</key>
        <array/>
        <key>DisableConsoleAccess</key>
        <<%= @disable_console_access %>/>
        <key>EnableExternalAccounts</key>
        <<%= @external_accounts_enabled %>/>
        <key>FlattenUserWorkgroups</key>
        <false/>
        <key>HideAdminUsers</key>
        <<%= @hide_admin_users %>/>
        <key>HideLocalUsers</key>
        <<%= @hide_local_users %>/>
        <key>HideMobileAccounts</key>
        <<%= @hide_mobile_accounts %>/>
        <key>IncludeNetworkUser</key>
        <<%= @include_network_user %>/>
        <key>LocalUserLoginEnabled</key>
        <<%= @local_user_login_enabled %>/>
        <key>LocalUsersHaveWorkgroups</key>
        <false/>
        <key>LoginwindowText</key>
        <string><%= @loginwindow_text %></string>
        <key>PayloadEnabled</key>
        <true/>
        <key>PayloadIdentifier</key>
        <string><%= @profile_identifier_prefix %>.loginwindow.84364940-3884-0137-bb47-784f43519bbc.loginwindow</string>
        <key>PayloadType</key>
        <string>com.apple.loginwindow</string>
        <key>PayloadUUID</key>
        <string>57BD794C-44DE-4497-B84D-713A69C54C4E</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>RestartDisabled</key>
        <<%= @restart_button_disabled %>/>
        <key>RetriesUntilHint</key>
        <integer>3</integer>
        <key>SHOWFULLNAME</key>
        <<%= @show_fullname %>/>
        <key>SHOWOTHERUSERS_MANAGED</key>
        <<%= @show_other_users_managed %>/>
        <key>ShutDownDisabled</key>
        <<%= @shutdown_button_disabled %>/>
        <key>SleepDisabled</key>
        <<%= @sleep_button_disabled %>/>
        <key>com.apple.login.mcx.DisableAutoLoginClient</key>
        <<%= @disable_auto_login %>/>
      </dict>
      <dict>
        <key>PayloadDisplayName</key>
        <string>Login Window: Scripts</string>
        <key>PayloadEnabled</key>
        <true/>
        <key>PayloadIdentifier</key>
        <string><%= @profile_identifier_prefix %>.loginwindow.84364940-3884-0137-bb47-784f43519bbc.mcxloginscripts</string>
        <key>PayloadType</key>
        <string>com.apple.mcxloginscripts</string>
        <key>PayloadUUID</key>
        <string>0DE258E3-DC53-484C-9193-42C4A97BEA29</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>skipLoginHook</key>
        <<%= @skip_login_hook %>/>
        <key>skipLogoutHook</key>
        <<%= @skip_logout_hook %>/>
      </dict>
    </array>


  </dict>
</plist>
