<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>PayloadDisplayName</key>
    <string>Screen Saver Settings</string>
    <key>PayloadDescription</key>
    <string>Screen saver configuration</string>
    <key>PayloadOrganization</key>
    <string><%= @profile_payload_org %></string>
    <key>PayloadRemovalDisallowed</key>
    <<%= @payload_removal_disallowed %>/>
    <key>PayloadScope</key>
    <string>System</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadIdentifier</key>
    <string><%= @profile_identifier_prefix %>.screen_saver.user</string>
    <key>PayloadUUID</key>
    <string>26F7FA12-DFDD-4F1A-8D57-95D7281E860D</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadEnabled</key>
    <true/>
    <key>PayloadContent</key>
    <array>
      <dict>
        <key>PayloadDisplayName</key>
        <string>Screen Saver</string>
        <key>PayloadIdentifier</key>
        <string><%= @profile_identifier_prefix %>.screensaver</string>
        <key>PayloadType</key>
        <string>com.apple.screensaver.user</string>
        <key>PayloadUUID</key>
        <string>40243672-D85F-454A-B3EE-2173394B01EB</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>loginWindowIdleTime</key>
        <string><%= @login_window_idle_time %></string>
        <% if @login_window_module_path == true -%>
          <key>loginWindowModulePath</key>
          <string><%= @login_window_module_path %></string>
        <% end -%>
        <% if @ask_for_password == true -%>
          <key>askForPassword</key>
          <<%= @ask_for_password %>/>
          <key>askForPasswordDelay</key>
          <integer><%= @ask_for_password_delay %></integer>
        <% end -%>
      </dict>
      <dict>
        <key>PayloadDisplayName</key>
        <string>Screen Saver – User</string>
        <key>PayloadIdentifier</key>
        <string><%= @profile_identifier_prefix %>.screensaver.user</string>
        <key>PayloadType</key>
        <string>com.apple.screensaver.user</string>
        <key>PayloadUUID</key>
        <string>85F0C975-98DB-436E-8424-FCB53E5D0675</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>idleTime</key>
        <integer><%= @idle_time %></integer>
        <% if @screen_saver_name == true -%>
          <key>modulePath</key>
          <string><%= @screen_saver_path %></string>
        <% end -%>
      </dict>
    </array>
  </dict>
</plist>