<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>AutoLogOutDelay</key>
			<integer>0</integer>
			<key>MultipleSessionEnabled</key>
			<true/>
			<key>PayloadDisplayName</key>
			<string>Login Window:  Global Preferences</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.wintermute.local.32cfff00-3884-0137-bb46-784f43519bbc.alacarte.loginwindow.84364940-3884-0137-bb47-784f43519bbc.GlobalPreferences</string>
			<key>PayloadType</key>
			<string>.GlobalPreferences</string>
			<key>PayloadUUID</key>
			<string>f7699c43-0682-83c8-11a0-ccc0dd8b9435</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadDisplayName</key>
			<string>Login Window</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.wintermute.local.32cfff00-3884-0137-bb46-784f43519bbc.alacarte.loginwindow.84364940-3884-0137-bb47-784f43519bbc.managed</string>
			<key>PayloadType</key>
			<string>com.apple.SetupAssistant.managed</string>
			<key>PayloadUUID</key>
			<string>36bcae02-d69a-9e4b-1835-ae86ddd12e26</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>SkipAppearance</key>
			<true/>
			<key>SkipCloudSetup</key>
			<true/>
			<key>SkipPrivacySetup</key>
			<true/>
			<key>SkipSiriSetup</key>
			<true/>
			<key>SkipiCloudStorageSetup</key>
			<true/>
		</dict>
		<dict>
			<key>PayloadDisplayName</key>
			<string>Login Window:  Screen Saver Preferences</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.wintermute.local.32cfff00-3884-0137-bb46-784f43519bbc.alacarte.loginwindow.84364940-3884-0137-bb47-784f43519bbc.screensaver</string>
			<key>PayloadType</key>
			<string>com.apple.screensaver</string>
			<key>PayloadUUID</key>
			<string>9ac225ad-e3c4-7147-cc80-acfe8d34c28b</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>idleTime</key>
			<integer>1200</integer>
			<key>loginWindowIdleTime</key>
			<integer>1200</integer>
		</dict>
		<dict>
			<key>DisableGuestAccount</key>
			<false/>
			<key>EnableGuestAccount</key>
			<true/>
			<key>PayloadDisplayName</key>
			<string>Login Window:  MCX Preferences</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.wintermute.local.32cfff00-3884-0137-bb46-784f43519bbc.alacarte.loginwindow.84364940-3884-0137-bb47-784f43519bbc.MCX</string>
			<key>PayloadType</key>
			<string>com.apple.MCX</string>
			<key>PayloadUUID</key>
			<string>9577d72c-a9bf-0794-fe8b-8224fe3bdf15</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>AdminHostInfo</key>
			<string>HostName</string>
			<key>AdminMayDisableMCX</key>
			<true/>
			<key>AllowList</key>
			<array/>
			<key>AlwaysShowWorkgroupDialog</key>
			<false/>
			<key>CombineUserWorkgroups</key>
			<true/>
			<key>DenyList</key>
			<array/>
			<key>DisableConsoleAccess</key>
			<true/>
			<key>EnableExternalAccounts</key>
			<true/>
			<key>FlattenUserWorkgroups</key>
			<false/>
			<key>HideAdminUsers</key>
			<false/>
			<key>HideLocalUsers</key>
			<false/>
			<key>HideMobileAccounts</key>
			<false/>
			<key>IncludeNetworkUser</key>
			<true/>
			<key>LocalUserLoginEnabled</key>
			<true/>
			<key>LocalUsersHaveWorkgroups</key>
			<false/>
			<key>LoginwindowText</key>
			<string>This Mac is managed by Tumblr Core Automation &amp; Tools</string>
			<key>PayloadDisplayName</key>
			<string>Login Window</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.wintermute.local.32cfff00-3884-0137-bb46-784f43519bbc.alacarte.loginwindow.84364940-3884-0137-bb47-784f43519bbc.loginwindow</string>
			<key>PayloadType</key>
			<string>com.apple.loginwindow</string>
			<key>PayloadUUID</key>
			<string>0d340d38-db49-252a-36e8-d71df990ffa5</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>RestartDisabled</key>
			<true/>
			<key>RetriesUntilHint</key>
			<integer>3</integer>
			<key>SHOWFULLNAME</key>
			<false/>
			<key>SHOWOTHERUSERS_MANAGED</key>
			<true/>
			<key>ShutDownDisabled</key>
			<true/>
			<key>SleepDisabled</key>
			<true/>
			<key>com.apple.login.mcx.DisableAutoLoginClient</key>
			<true/>
		</dict>
		<dict>
			<key>PayloadDisplayName</key>
			<string>Login Window:  Scripts</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.wintermute.local.32cfff00-3884-0137-bb46-784f43519bbc.alacarte.loginwindow.84364940-3884-0137-bb47-784f43519bbc.mcxloginscripts</string>
			<key>PayloadType</key>
			<string>com.apple.mcxloginscripts</string>
			<key>PayloadUUID</key>
			<string>b436c604-1879-f6d9-703a-91c8a7a3deb1</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>skipLoginHook</key>
			<false/>
			<key>skipLogoutHook</key>
			<false/>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Login window settings</string>
	<key>PayloadDisplayName</key>
	<string>Settings for New Device Group</string>
	<key>PayloadEnabled</key>
	<true/>
	<key>PayloadIdentifier</key>
	<string>com.apple.mdm.wintermute.local.32cfff00-3884-0137-bb46-784f43519bbc.alacarte</string>
	<key>PayloadOrganization</key>
	<string>Tumblr</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>32cfff00-3884-0137-bb46-784f43519bbc</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
